package DreamTeamGame;

import java.util.ArrayList;

public class Model {
    Map simpleMap;

    //здесь я вручную создаю карту,          A Р Р И Л
    //которая в будущем будет считываться    Ь Б П Н И
    //из файла                               Л У З И В
    //                                       Б О К Ф Ь
    //                                       А Р Д Е Л
    //АРБУЗ    A1,A2,B2,C2,C3
    //КОРАБЛЬ  D3,D2,E2,E1,D1,C1,B1
    //ПРИЛИВ   B3,A3,A4,A5,B5,C5
    //ДЕЛЬФИН  E3,E4,E5,D5,D4,C4,B4

    //эти слова создадутся в Presentor в загрузятся в simpleMap
    //но в будущем надо будет сюда добавить метод создания карт

    //нужно добавить функцию чтения из файла и создания набора последовательностей

}
